const Ssp = () => {
  return (
    <div
      style={{
        position: "absolute",
        top: 150,
        left: 240,
        width: "70vw",
        fontSize: 30,
      }}
    >
      <div style={{ display: "flex", justifyContent: "center" }}>
        <h2
          style={{
            padding: "15px 30px",
            backgroundColor: "rgba(0,0,0,0.6)",
            borderRadius: 40,
          }}
        >
          संगीत शास्त्र परिचय
        </h2>
      </div>

      <h4 style={{ padding: 20, fontSize: 50, textDecoration: "underline" }}>
        भारतीय संगीत
      </h4>
      <p style={{ padding: "20px" }}>
        भारत में संगीत की समृद्ध परम्परा रही है। गिने-चुने देशों में ही संगीत की
        इतनी पुरानी एवं इतनी समृद्ध परम्परा पायी जाती है। माना जाता है कि संगीत
        का प्रारम्भ सिंधु घाटी की सभ्यता के काल में हुआ हालांकि इस दावे के
        एकमात्र साक्ष्य हैं उस समय की एक नृत्य बाला की मुद्रा में कांस्य मूर्ति
        और नृत्य, नाटक और संगीत के देवता की पूजा का प्रचलन। सिंधु घाटी की सभ्यता
        के पतन के पश्चात् वैदिक संगीत की अवस्था का प्रारम्भ हुआ जिसमें संगीत की
        शैली में भजनों और मंत्रों के उच्चारण से ईश्वर की पूजा और अर्चना की जाती
        थी। इसके अतिरिक्त दो भारतीय महाकाव्यों - रामायण और महाभारत की रचना में
        संगीत का मुख्य प्रभाव रहा। भारत में सांस्कृतिक काल से लेकर आधुनिक युग तक
        आते-आते संगीत की शैली और पद्धति में जबरदस्त परिवर्तन हुआ है। भारतीय
        संगीत के इतिहास के महान संगीतकारों जैसे कि स्वामी हरिदास, तानसेन, अमीर
        खुसरो आदि ने भारतीय संगीत की उन्नति में बहुत योगदान किया है जिसकी कीर्ति
        को पंडित रवि शंकर, भीमसेन गुरूराज जोशी, पंडित जसराज, प्रभा अत्रे,
        सुल्तान खान आदि जैसे संगीत प्रेमियों ने आज के युग में भी कायम रखा हुआ
        है। भारतीय संगीत में यह माना गया है कि संगीत के आदि प्रेरक शिव और
        सरस्वती है।[1] इसका तात्पर्य यही जान पड़ता है कि मानव इतनी उच्च कला को
        बिना किसी दैवी प्रेरणा के, केवल अपने बल पर, विकसित नहीं कर सकता।
      </p>
      <h4 style={{ padding: 20, fontSize: 50, textDecoration: "underline" }}>
        नाद
      </h4>
      <p style={{ padding: "20px" }}>
        आवाज अथवा ध्वनि विशेष को नाद कहते हैं। दो पदार्थों के परस्पर टकराने से
        नाद या आवाज उत्पन्न होती है। इसके दो भेद हैं - एक, जो नाद क्षणिक हो, लहर
        शून्य अथवा जड़ हो, तो वह आवाज संगीत के लिये अनुपयोगी तथा स्वर शून्य
        रहेगी। लेकिन दूसरे प्रकार की आवाज कुछ देर तक वायुमंडल पर अपना मधुर
        प्रभाव डालती है। वह सस्वर होने के कारण संगीत के लिये उपयोगी है। नाद के
        दो प्रकार हैं, अनहद नाद और लौकिक नाद। ऐसा कोई भी प्राणी नहीं है जिसने
        संगीत रूपी दैवी शक्ति को न सुना हो। नदियों की मधुर कलकल ध्वनि, झरनों की
        झरझर, पक्षियों का कूजन किसने नहीं सुना है। प्रकृति प्रदत्त जो नाद लहरी
        उत्पन्न होती है, वह अनहद नाद का स्वरूप है जो कि प्रकृति की स्वाभाविक
        प्रक्रिया है। लेकिन जो नाद स्वर लहरी, दो वस्तुओं के परस्पर घर्षण से अथवा
        टकराने से पैदा होती है उसे लौकिक नाद कहते हैं। वातावरण पर अपने नाद को
        बिखेरने के लिये, बाह्य हवा पर कंठ के अँदर से उत्पन्न होने वाली वजनदार
        हवा जब परस्पर टकराती है, उसी समय कंठ स्थित 'स्वर तंतु' (Vocal Cords) नाद
        पैदा करते हैं। अत: मानव प्राणी द्वारा निर्मित आवाज लौकिक है।
      </p>

      <h4 style={{ padding: 20, fontSize: 50, textDecoration: "underline" }}>
        स्वर
      </h4>
      <p style={{ padding: "20px" }}>
        स्वर एक निश्चित ऊँचाई की आवाज़ का नाम है। यह कर्ण मधुर आनंददायी होता है।
        जिसमें स्थिरता होनी चाहिये, जिसे कुछ देर सुनने पर, मन में आनंद की लहर
        पैदा होनी चाहिये। यह अनुभूति की वस्तु है। भारतीय संगीत में एक स्वर की
        उँचाई से ठीक दुगुनी उँचाई के स्वर के बीच 22 संगीतोपयोगि नाद हैं जिन्हें
        "श्रुति" कहा गया है। इन्हीं दोनो उँचाईयों के बीच निश्चित श्रुतियों पर
        सात शुद्ध स्वर विद्यमान हैं जिन्हें सा, रे, ग, म, प, ध और नि, से जाना
        जाता है और जिनके नाम क्रमश: षडज, ऋषभ, गंधार, मध्यम, पंचम, धैवत और निषाद
        हैं। इसे सप्तक के नाम से जाना जाता है। प्रायः गायक अथवा गायिका के आवाज
        कि रेंज तीन सप्तक तक सीमित होती है। जिसमें गायक के प्राकृतिक सप्तक को
        मध्य सप्तक कहते है। मध्य सप्तक से कम फ्रिक्वेंसी वाले सप्तक को मंद्र
        सप्तक एवम उँची फ्रिक्वेंसी वाले सप्तक को तार सप्तक कहते है। उपरोक्त सात
        शुद्ध स्वरों में 'सा' और 'प' अचल स्वर हैं पर बाकी 5 स्वर अपनी जगह से
        हटते हैं, जिनमें रे, ग, ध, नि ये चार स्वर नीचे की तरफ हटते हैं और उन्हे
        कोमल स्वर कहते हैं। इसी तरह मध्यम ऊपर की तरफ हटता है और उसे तीव्र स्वर
        कहते हैं। इस तरह एक सप्तक में कोमल, शुद्ध और तीव्र स्वर मिलाकर कुल 12
        स्वर होते हैं। 12 स्वरों के नाम इस प्रकार हैं - सा, रे कोमल, रे शुद्ध, ग
        कोमल, ग शुद्ध, म शुद्ध, म तीव्र, पंचम, ध कोमल, ध शुद्ध, नि कोमल और नि
        शुद्ध।
      </p>
      <h4 style={{ padding: 20, fontSize: 50, textDecoration: "underline" }}>
        वर्ण
      </h4>
      <p style={{ padding: "20px" }}>
        वर्ण का अर्थ है मोड। संगीत मे 4 प्रकार के वर्ण होते हैं: आरोही वर्ण -
        केवल आरोह मात्र। तात्पर्य यह कि नीची आवाज़ को ऊँचाई की ओर ले जाना। फिर
        चाहे वह एक स्वर तक ही ऊँची क्यों न हो, आरोही वर्ण है। अवरोही वर्ण - केवल
        अवरोह मात्र। ऊँची से नीची आवाज़ ले आना। स्थाई वर्ण - एक ही जगह पर रुकते
        हुए कुछ देर तक कायम रहना। जैसे - ममम धध गग रेरे पप आदि। संचारी वर्ण -
        ऊपर लिखे हुए तीनो वर्णों का मिला-जुला रूप। जहाँ से मन चाहा वहाँ को आवाज़
        कि दिशा बदल दी या एक ही स्थान पर रुक गये।
      </p>
      <h4 style={{ padding: 20, fontSize: 50, textDecoration: "underline" }}>
        आरोह-अवरोह
      </h4>
      <p style={{ padding: "20px" }}>
        आरोह : (सा से सा') अर्थात मध्य सप्तक के सा से तार सप्तक के सा तक चढाने
        की क्रिया का नाम है आरोह। अवरोह : सा' से सा अर्थात तार सप्तक से मध्य
        सप्तक के सा तक उतरने का नाम है अवरोह।
      </p>
      <h4 style={{ padding: 20, fontSize: 50, textDecoration: "underline" }}>
        राग
      </h4>
      <p style={{ padding: "20px" }}>
        स्वरों की ऐसी मधुर तथा आकर्षक ध्वनि जो सुनिश्चित् आरोह-अवरोह, जाति, समय,
        वर्ण, वादी-संवादी, मुख्य-अंग आदि नियमों से बद्घ हो और जो वायुमंडल पर
        अपना प्रभाव अंकित करने मे समर्थ हो। वातावरण पर प्रभाव डालने के लिये राग
        मे गायन, वादन के अविभाज्य 8 अंगों का प्रयोग होना चाहिये। ये 8 अंग या
        अष्टांग इस प्रकार हैं: स्वर, गीत, ताल और लय, आलाप, तान, मींड, गमक एवं
        बोलआलाप और बोलतान। उपर्युक्त 8 अंगों के समुचित प्रयोग के द्वारा ही राग
        को सजाया जाता है।
      </p>
    </div>
  );
};

export default Ssp;
